# Дан список чисел. Определите, сколько в нем 
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

n=[1, 1, 2, 0, -1, 3, 4, 4]
# result=[]

# for i in n:
#     if i not in result:
#         result.append(i)
# print (result)

while 

