
# list_1 = [] # тут создали список благодаря квадратным скобкам

# если хотим чтобы скобки квадратные при выводе не отображались, то ставим в принте звездочку - print (*list_1)

# print (list_1) 

# list_1 = list() #это функция list - создаем список

list_1 = [1, 2, 3, 4]

# for i in list_1: - переменная i возвращает по очереди значения из всего списка 
#     print (i)

# print (len(list_1))  - ФУНКЦИЯ LEN ВЫВОДИТ ДЛИНУ СПИСКА


# print (list_1 [0])  -   квадратные скобки чтобы вывести определнный элемент из списка

# print (list_1 [-1])  -  индексация начинается с конца, то есть выведется последнее число из списка

# print (list_1[:2])   -   выведет первые два числа, если (2:)

# list_1.append(734)   -  функция append позволяет добавлять число в конец списка


# list_1.pop()    -  функция рop удаляет последний элемент списка и возвращает его (печатает его в терминале), если в скобках
# указать конкрутный индекс, рор удалит и выведет именно это число


# list_1.insert(2,11)   -   вставит число 11 на 2 индекс в списке